tap "homebrew/bundle"
tap "homebrew/services"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion@2"
brew "cabextract"
brew "cmake"
brew "coreutils"
brew "curl"
brew "entr"
brew "ffmpeg"
brew "findutils"
brew "gettext"
brew "gnu-sed"
brew "pinentry"
brew "gnupg"
brew "go"
brew "grc"
brew "grep"
brew "htop"
brew "icu4c"
brew "libxml2"
brew "libyaml"
brew "moreutils"
brew "mtr"
brew "nmap"
brew "perl"
brew "pidcat"
brew "pinentry-mac"
brew "pkg-config"
brew "pstree"
brew "pv"
brew "python"
brew "rename"
brew "ruby"
brew "screen"
brew "terminal-notifier"
brew "tree"
brew "uv"
brew "vim"
brew "wget"
brew "yarn"
brew "zopfli"
brew "zsh"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "fzf"
brew "git-delta"
brew "gh"
brew "git"
brew "jq"
brew "tldr"
brew "zoxide"
brew "httpie"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "suspicious-package"
cask "tunnelblick"
cask "wireshark"
