tap "michaeldfallen/formula"
tap "homebrew/dupes"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "acrogenesis/macchanger"
tap "caskroom/cask"
brew "ack"
brew "gdbm"
brew "asciinema"
brew "freetype"
brew "libtool"
brew "perl"
brew "git"
brew "asciinema2gif"
brew "autoconf"
brew "autoenv"
brew "automake"
brew "bash"
brew "bash-completion@2"
brew "cabextract"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "entr"
brew "libnet"
brew "ettercap"
brew "lame"
brew "xvid"
brew "ffmpeg"
brew "findutils"
brew "fontconfig"
brew "fortune"
brew "gdb"
brew "gettext"
brew "gnu-sed", args: ["with-default-names"]
brew "libunistring"
brew "nettle"
brew "libusb", args: ["universal"]
brew "pinentry"
brew "gnupg"
brew "go"
brew "gpg-agent"
brew "gradle"
brew "grc"
brew "grep"
brew "htop"
brew "hub"
brew "icu4c"
brew "imap-uw"
brew "jasper"
brew "libconfig"
brew "libevent"
brew "libusb-compat"
brew "libgphoto2"
brew "libicns", args: ["universal"]
brew "libvo-aacenc"
brew "libxml2"
brew "libyaml"
brew "little-cms2"
brew "lua"
brew "makedepend"
brew "maven"
brew "mhash"
brew "mcrypt"
brew "python"
brew "mercurial"
brew "mono"
brew "moreutils"
brew "mtr"
brew "net-snmp"
brew "nmap"
brew "pidcat"
brew "pinentry-mac"
brew "pkg-config"
brew "privoxy", restart_service: true
brew "pstree"
brew "pv"
brew "rename"
brew "ruby"
brew "sane-backends"
brew "screen"
brew "sl"
brew "terminal-notifier"
brew "tomcat"
brew "tor"
brew "tree"
brew "unixodbc"
brew "vim"
brew "wget"
brew "yarn"
brew "zopfli"
brew "zsh"
brew "acrogenesis/macchanger/macchanger"
brew "homebrew/php/composer"
brew "homebrew/php/php55-mcrypt"
brew "homebrew/php/phpmyadmin"
brew "michaeldfallen/formula/git-radar"
cask "betterzipql"
cask "insomniax"
cask "launchrocket"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "suspicious-package"
cask "tunnelblick"
cask "webpquicklook"
cask "wireshark"
