# ─── Shell ───────────────────────────────────────────────────────────────────
brew "bash"                        # macOS ships bash 3.2; this gives 5.x
brew "bash-completion@2"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "pure"

# ─── Modern CLI replacements ─────────────────────────────────────────────────
brew "bat"                         # cat
brew "eza"                         # ls
brew "fd"                          # find
brew "ripgrep"                     # grep
brew "zoxide"                      # cd
brew "fzf"                         # fuzzy finder
brew "git-delta"                   # diff

# ─── Git & GitHub ────────────────────────────────────────────────────────────
brew "git"
brew "gh"

# ─── GNU core utils ──────────────────────────────────────────────────────────
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "grep"
brew "moreutils"                   # sponge, ts, etc.

# ─── Terminal multiplexer ────────────────────────────────────────────────────
brew "tmux"

# ─── Essential tools ─────────────────────────────────────────────────────────
brew "curl"
brew "wget"
brew "jq"
brew "yq"                          # jq for YAML
brew "xh"                          # modern curl/httpie alternative
brew "llm"                         # LLM CLI (Simon Willison)
brew "neovim"
brew "htop"
brew "tree"
brew "pv"                          # pipe viewer
brew "entr"                        # run cmd on file change
brew "tldr"
brew "mtr"                         # network diagnostics
brew "nmap"

# ─── GPG ─────────────────────────────────────────────────────────────────────
brew "gnupg"
brew "pinentry-mac"

# ─── Node ────────────────────────────────────────────────────────────────────
brew "fnm"                         # fast node manager

# ─── Python ──────────────────────────────────────────────────────────────────
brew "uv"
brew "pygments"                    # colorize zsh plugin

# ─── Media ───────────────────────────────────────────────────────────────────
brew "ffmpeg"

# ─── Fonts ───────────────────────────────────────────────────────────────────
cask "font-hack-nerd-font"         # nerd font for nvim/lualine icons

# ─── Casks ───────────────────────────────────────────────────────────────────
cask "ghostty"
cask "suspicious-package"          # inspect .pkg installers
